libopencm3/libopencm3/lib/stm32/common/spi_common_all.c
/*---------------------------------------------------------------------------*/
/** @brief SPI Enable Transmit Transfers via DMA

This allows transmissions to proceed unattended using DMA to move data to the
transmit buffer as it becomes available. The DMA channels provided for each
SPI peripheral are given in the Technical Manual DMA section.

@param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
*/

void spi_enable_tx_dma(uint32_t spi)
{
	SPI_CR2(spi) |= SPI_CR2_TXDMAEN;
}

/*---------------------------------------------------------------------------*/
/** @brief SPI Disable Transmit Transfers via DMA

@param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
*/

void spi_disable_tx_dma(uint32_t spi)
{
	SPI_CR2(spi) &= ~SPI_CR2_TXDMAEN;
}

/*---------------------------------------------------------------------------*/
/** @brief SPI Enable Receive Transfers via DMA

This allows received data streams to proceed unattended using DMA to move data
from the receive buffer as data becomes available. The DMA channels provided
for each SPI peripheral are given in the Technical Manual DMA section.

@param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
*/

void spi_enable_rx_dma(uint32_t spi)
{
	SPI_CR2(spi) |= SPI_CR2_RXDMAEN;
}

/*---------------------------------------------------------------------------*/
/** @brief SPI Disable Receive Transfers via DMA

@param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
*/

void spi_disable_rx_dma(uint32_t spi)
{
	SPI_CR2(spi) &= ~SPI_CR2_RXDMAEN;
}

/*---------------------------------------------------------------------------*/
/** @brief SPI Standard Mode selection
@details Set SPI standard Modes
Mode | CPOL | CPHA
---- | ---- | ----
 0   |  0   |  0
 1   |  0   |  1
 2   |  1   |  0
 3   |  1   |  1
@param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
@param[in] mode Unsigned int8. Standard SPI mode (0, 1, 2, 3)
@sa spi_set_clock_phase_0 spi_set_clock_phase_1
@sa spi_set_clock_polarity_0 spi_set_clock_polarity_1
*/

void spi_set_standard_mode(uint32_t spi, uint8_t mode)
{
	if (mode > 3) {
		return;
	}

	uint32_t reg32 = SPI_CR1(spi) & ~(SPI_CR1_CPOL | SPI_CR1_CPHA);
	SPI_CR1(spi) = reg32 | mode;
}


/*---------------------------------------------------------------------------*/
/** @brief I2S Enable the SPI/I2S hardware
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 */
void i2s_enable(uint32_t spi)
{
	SPI_I2SCFGR(spi) |= SPI_I2SCFGR_I2SMOD;
	SPI_I2SCFGR(spi) |= SPI_I2SCFGR_I2SE;
}

/** @brief I2S Disable the SPI/I2S hardware
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 */
void i2s_disable(uint32_t spi)
{
	SPI_I2SCFGR(spi) &= ~SPI_I2SCFGR_I2SE;
}

/** @brief Select I2S standard.
 *
 * Select the I2S standard to use: Philips, MSB or LSB justified
 * or PCM.
 * I2S must be disabled when calling this function.
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 * @param[in] std i2s_standard to select. @ref i2s_standards
 */
void i2s_set_standard(uint32_t spi, enum i2s_standards std)
{
	/* Clear and write the two I2SSTD bits in I2SCFGR */
	uint32_t reg = SPI_I2SCFGR(spi);
	reg &= ~(0x3<<SPI_I2SCFGR_I2SSTD_LSB);
	reg |= std << SPI_I2SCFGR_I2SSTD_LSB;
	SPI_I2SCFGR(spi) = reg;
}

/** @brief Set I2S dataformat.
 *
 * This selects the channel and data lenghts.
 * Allowed values are 16, 24 or 32 for data length.
 * For 16 bit data only, a channel lenght of 16 or 32 can be selected.
 * Selecting 24 and 32 bit makes the channel 32bit
 * I2S must be disabled when calling this function.
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 * @param[in] format i2s_dataformats to select. @ref i2s_dataformats
 */
void i2s_set_dataformat(uint32_t spi, enum i2s_dataformats format)
{
	/* Clear and write the three lowest bits.
	 * Here we expect the enum to have correct bitpattern!*/
	uint32_t reg = SPI_I2SCFGR(spi);
	reg &= ~0x7;
	reg |= format;
	SPI_I2SCFGR(spi) = reg;
}

/** @brief Enable generating master clock
 * 
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 */
void i2s_masterclock_enable(uint32_t spi)
{
	SPI_I2SPR(spi) |= SPI_I2SPR_MCKOE;
}

/** @brief Set I2S prescaler clock divisor
 * The divisor defines the audio sampling frequency together with the
 * input I2S input clock (set by @ref rcc_clock_setup_pll).
 * The sampling frequency equation is given in the chip reference manual
 * as (when master clock output is enabled):
 * Fs = I2Sclk / (256*((2*I2SDIV + ODD) * 8)
 * or (when master clock is not enabled)
 * Fs = I2Sclk / (32*((2*I2SDIV + ODD))  for a 16 bit channel
 * Fs = I2Sclk / (64*((2*I2SDIV + ODD))  for a 32 bit channel
 *
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 * @param[in] i2sdiv integer value in the equation above. Valid range is 2-255, inclusive.
 * @param[in] odd the ODD bit value in equation above.
 */
void i2s_set_clockdiv(uint32_t spi, uint32_t i2sdiv, bool odd)
{
	SPI_I2SPR(spi) &= 0xfe00;
	SPI_I2SPR(spi) |= i2sdiv;
	SPI_I2SPR(spi) |= odd<<8;
}


/** @brief Set the I2S mode.
 * I.e. master/slave receive/transmit.
 *
 * @param[in] spi Unsigned int32. SPI peripheral identifier @ref spi_reg_base.
 * @param[in] mode @ref i2s_modes
 */
void i2s_set_mode(uint32_t spi, enum i2s_modes mode)
{
	uint16_t reg = SPI_I2SCFGR(spi);
	reg &= ~(0x3 << SPI_I2SCFGR_I2SCFG_LSB);
	reg |= mode << SPI_I2SCFGR_I2SCFG_LSB;
	SPI_I2SCFGR(spi) = reg;
}

/**@}*/
